In [1]:
import numpy as np 
import pandas as pd 
from pandas import DataFrame,Series 
from numpy.random import randn

In [3]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser

1  a   -0.693882
   b    0.919012
   c    0.401312
2  a    1.515434
   b   -0.679840
   c   -0.696307
dtype: float64

In [5]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [6]:
ser[1]

a   -0.693882
b    0.919012
c    0.401312
dtype: float64

In [7]:
ser[2]

a    1.515434
b   -0.679840
c   -0.696307
dtype: float64

In [11]:
ser[:,'a']

1   -0.693882
2    1.515434
dtype: float64

In [12]:
dframe = ser.unstack()

dframe

          a         b         c
1 -0.693882  0.919012  0.401312
2  1.515434 -0.679840 -0.696307

In [13]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index = [['a','a','b','b'],[1,2,1,2]],columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [14]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [15]:
dframe2.index.names = ['INDEX_1','INDEX_2']

dframe2.columns.names =['CITIES','TEMP']

dframe2

CITIES            NY      LA   SF
TEMP            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [17]:
dframe2.swaplevel('CITIES','TEMP',axis=1)

TEMP            cold hot     cold
CITIES            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [26]:
dframe2.sort_index()

CITIES            NY      LA   SF
TEMP            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [23]:
dframe2.sum(level='TEMP',axis=1)

TEMP             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27